app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", nil], ["created_at", Tue, 09 Jun 2015 15:30:29 UTC +00:00], ["title", ""], ["updated_at", Tue, 09 Jun 2015 15:30:29 UTC +00:00]]
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 12 Jun 2015 03:21:57 UTC +00:00], ["name", "ssss"], ["updated_at", Fri, 12 Jun 2015 03:21:57 UTC +00:00]]
---
	def create
  @article = Article.new
  @article.title = params[:article][:title]
  @article.body = params[:article][:body]
  @article.tag_list = params[:article][:tag_list]
  @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "13"]]
UPDATE "articles" SET "image_file_name" = 'beast.png', "image_content_type" = 'image/png', "image_file_size" = 27720, "image_updated_at" = '2015-06-12 06:00:47.314844', "updated_at" = '2015-06-12 06:00:47.848874' WHERE "articles"."id" = 16
---
   def update
    @article = Article.find params[:id]
    if @article.update_attributes(article_params)