app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "crypted_password", "email", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 12 Jun 2015 08:13:20 UTC +00:00], ["crypted_password", nil], ["email", ""], ["salt", nil], ["updated_at", Fri, 12 Jun 2015 08:13:20 UTC +00:00], ["username", ""]]
---
  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "authors" SET "salt" = 'ZoY6fAnsbHE7mJmAsPan', "crypted_password" = '$2a$10$K9gl2P4MVQ1Dy/DTw5wAP.Aoz4VbWSjGPye7yQQ1AjdalbY.wOtjW', "updated_at" = '2015-06-12 08:58:28.467192' WHERE "authors"."id" = 1
---
  def update
    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(params[:author])

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 3]]
---
  def destroy
    @author = Author.find(params[:id])
    @author.destroy