app/controllers/comments_controller.rb

	def create
  		@comment = Comment.new(comment_params)
  		@comment.article_id = params[:article_id]

  		@comment.save
---
INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 16], ["author_name", "amy"], ["body", "this is awesome"], ["created_at", Thu, 11 Jun 2015 05:46:07 UTC +00:00], ["updated_at", Thu, 11 Jun 2015 05:46:07 UTC +00:00]]